fio-test/results/raizn_rand_read/128k-io_uring-2.out
job1: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=io_uring, iodepth=256
fio-3.28
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=85271: Mon Aug 26 13:46:14 2024
  read: IOPS=99.4k, BW=12.1GiB/s (13.0GB/s)(160GiB/13181msec)
    slat (nsec): min=298, max=1024.1k, avg=1451.95, stdev=1781.59
    clat (usec): min=33, max=19738, avg=2571.65, stdev=1374.93
     lat (usec): min=35, max=19739, avg=2573.17, stdev=1374.97
    clat percentiles (usec):
     |  1.00th=[  553],  5.00th=[  898], 10.00th=[ 1172], 20.00th=[ 1450],
     | 30.00th=[ 1745], 40.00th=[ 2024], 50.00th=[ 2343], 60.00th=[ 2704],
     | 70.00th=[ 3130], 80.00th=[ 3556], 90.00th=[ 3982], 95.00th=[ 4817],
     | 99.00th=[ 7635], 99.50th=[ 8848], 99.90th=[11076], 99.95th=[11994],
     | 99.99th=[16057]
   bw (  MiB/s): min= 4871, max=23291, per=99.14%, avg=12323.11, stdev=5341.77, samples=26
   iops        : min=38968, max=186332, avg=98584.81, stdev=42734.15, samples=26
  lat (usec)   : 50=0.01%, 100=0.02%, 250=0.06%, 500=0.38%, 750=3.35%
  lat (usec)   : 1000=2.07%
  lat (msec)   : 2=33.29%, 4=51.08%, 10=9.57%, 20=0.20%
  cpu          : usr=17.45%, sys=20.67%, ctx=464988, majf=0, minf=486
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=1310720,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=12.1GiB/s (13.0GB/s), 12.1GiB/s-12.1GiB/s (13.0GB/s-13.0GB/s), io=160GiB (172GB), run=13181-13181msec

Disk stats (read/write):
    dm-0: ios=688446/0, merge=0/0, ticks=252868/0, in_queue=252868, util=99.44%, aggrios=275703/0, aggrmerge=0/0, aggrticks=90115/0, aggrin_queue=90115, aggrutil=68.02%
  nvme1n2: ios=275711/0, merge=1/0, ticks=90017/0, in_queue=90017, util=68.02%
  nvme4n2: ios=275696/0, merge=0/0, ticks=89949/0, in_queue=89949, util=68.02%
  nvme0n2: ios=275711/0, merge=1/0, ticks=89965/0, in_queue=89965, util=68.02%
  nvme3n2: ios=275696/0, merge=0/0, ticks=90437/0, in_queue=90436, util=68.02%
  nvme2n2: ios=275703/0, merge=1/0, ticks=90209/0, in_queue=90209, util=68.02%