fio-test/results/raizn_rand_read/2048k-io_uring-8.out
job1: (g=0): rw=randread, bs=(R) 2048KiB-2048KiB, (W) 2048KiB-2048KiB, (T) 2048KiB-2048KiB, ioengine=io_uring, iodepth=256
fio-3.28
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=949561: Mon Sep 16 01:51:36 2024
  read: IOPS=5270, BW=10.3GiB/s (11.1GB/s)(160GiB/15543msec)
    slat (nsec): min=521, max=103718, avg=2413.12, stdev=2370.97
    clat (msec): min=4, max=192, avg=48.57, stdev=17.14
     lat (msec): min=4, max=192, avg=48.57, stdev=17.14
    clat percentiles (msec):
     |  1.00th=[   23],  5.00th=[   27], 10.00th=[   29], 20.00th=[   35],
     | 30.00th=[   39], 40.00th=[   43], 50.00th=[   45], 60.00th=[   49],
     | 70.00th=[   55], 80.00th=[   64], 90.00th=[   77], 95.00th=[   79],
     | 99.00th=[   84], 99.50th=[   94], 99.90th=[  163], 99.95th=[  178],
     | 99.99th=[  188]
   bw (  MiB/s): min= 4792, max=20748, per=99.91%, avg=10531.95, stdev=3690.60, samples=31
   iops        : min= 2396, max=10374, avg=5266.00, stdev=1845.36, samples=31
  lat (msec)   : 10=0.01%, 20=0.01%, 50=62.98%, 100=36.56%, 250=0.44%
  cpu          : usr=1.51%, sys=3.00%, ctx=76245, majf=0, minf=15
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=81920,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=10.3GiB/s (11.1GB/s), 10.3GiB/s-10.3GiB/s (11.1GB/s-11.1GB/s), io=160GiB (172GB), run=15543-15543msec

Disk stats (read/write):
    dm-0: ios=85997/0, merge=0/0, ticks=64320/0, in_queue=64320, util=99.55%, aggrios=151585/0, aggrmerge=124011/0, aggrticks=75298/0, aggrin_queue=75299, aggrutil=75.86%
  nvme1n2: ios=137805/0, merge=137792/0, ticks=69718/0, in_queue=69718, util=75.86%
  nvme4n2: ios=163644/0, merge=111954/0, ticks=79955/0, in_queue=79955, util=75.86%
  nvme0n2: ios=137805/0, merge=137791/0, ticks=69374/0, in_queue=69374, util=75.86%
  nvme3n2: ios=163644/0, merge=111954/0, ticks=81511/0, in_queue=81511, util=75.86%
  nvme2n2: ios=155029/0, merge=120566/0, ticks=75936/0, in_queue=75937, util=75.86%