fio-test/results/raizn_rand_read/4096k-io_uring-8.out
job1: (g=0): rw=randread, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=io_uring, iodepth=256
fio-3.28
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=949713: Mon Sep 16 01:51:55 2024
  read: IOPS=2753, BW=10.8GiB/s (11.6GB/s)(160GiB/14873msec)
    slat (nsec): min=537, max=68255, avg=2740.65, stdev=2788.68
    clat (msec): min=9, max=284, avg=92.94, stdev=46.11
     lat (msec): min=9, max=284, avg=92.95, stdev=46.11
    clat percentiles (msec):
     |  1.00th=[   36],  5.00th=[   40], 10.00th=[   44], 20.00th=[   50],
     | 30.00th=[   58], 40.00th=[   70], 50.00th=[   83], 60.00th=[   96],
     | 70.00th=[  117], 80.00th=[  132], 90.00th=[  155], 95.00th=[  197],
     | 99.00th=[  207], 99.50th=[  213], 99.90th=[  257], 99.95th=[  271],
     | 99.99th=[  284]
   bw (  MiB/s): min= 4640, max=23976, per=96.46%, avg=10626.24, stdev=5257.42, samples=29
   iops        : min= 1160, max= 5994, avg=2656.48, stdev=1314.33, samples=29
  lat (msec)   : 10=0.01%, 20=0.01%, 50=21.15%, 100=40.56%, 250=38.16%
  lat (msec)   : 500=0.12%
  cpu          : usr=1.23%, sys=1.39%, ctx=38995, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=40960,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=10.8GiB/s (11.6GB/s), 10.8GiB/s-10.8GiB/s (11.6GB/s-11.6GB/s), io=160GiB (172GB), run=14873-14873msec

Disk stats (read/write):
    dm-0: ios=85695/0, merge=0/0, ticks=60088/0, in_queue=60088, util=99.56%, aggrios=154083/0, aggrmerge=121373/0, aggrticks=77455/0, aggrin_queue=77455, aggrutil=79.73%
  nvme1n2: ios=146336/0, merge=129120/0, ticks=73876/0, in_queue=73876, util=79.73%
  nvme4n2: ios=159248/0, merge=116208/0, ticks=79561/0, in_queue=79561, util=79.73%
  nvme0n2: ios=146336/0, merge=129120/0, ticks=73479/0, in_queue=73480, util=79.71%
  nvme3n2: ios=159248/0, merge=116210/0, ticks=82254/0, in_queue=82254, util=79.73%
  nvme2n2: ios=159248/0, merge=116208/0, ticks=78105/0, in_queue=78105, util=79.72%