fio-test/results/raizn_rand_read/4k-io_uring-6.out
job1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=256
fio-3.28
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=183794: Thu Sep  5 18:49:43 2024
  read: IOPS=198k, BW=774MiB/s (811MB/s)(160GiB/211730msec)
    slat (nsec): min=522, max=2322.7k, avg=4200.22, stdev=2792.86
    clat (usec): min=12, max=4298, avg=1287.31, stdev=179.00
     lat (usec): min=15, max=4301, avg=1291.57, stdev=179.52
    clat percentiles (usec):
     |  1.00th=[  848],  5.00th=[  963], 10.00th=[ 1029], 20.00th=[ 1156],
     | 30.00th=[ 1221], 40.00th=[ 1270], 50.00th=[ 1303], 60.00th=[ 1352],
     | 70.00th=[ 1385], 80.00th=[ 1418], 90.00th=[ 1483], 95.00th=[ 1549],
     | 99.00th=[ 1696], 99.50th=[ 1778], 99.90th=[ 2040], 99.95th=[ 2212],
     | 99.99th=[ 2868]
   bw (  KiB/s): min=684424, max=1314648, per=100.00%, avg=793047.55, stdev=98137.24, samples=423
   iops        : min=171108, max=328662, avg=198261.92, stdev=24534.34, samples=423
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.15%, 1000=8.06%
  lat (msec)   : 2=91.67%, 4=0.12%, 10=0.01%
  cpu          : usr=19.10%, sys=80.88%, ctx=1478, majf=0, minf=104843
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=41943040,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=774MiB/s (811MB/s), 774MiB/s-774MiB/s (811MB/s-811MB/s), io=160GiB (172GB), run=211730-211730msec

Disk stats (read/write):
    dm-0: ios=22055718/0, merge=0/0, ticks=2035544/0, in_queue=2035544, util=100.00%, aggrios=4411384/0, aggrmerge=3/0, aggrticks=443849/0, aggrin_queue=443849, aggrutil=95.65%
  nvme1n2: ios=4411390/0, merge=2/0, ticks=442608/0, in_queue=442608, util=95.65%
  nvme4n2: ios=4411375/0, merge=1/0, ticks=444465/0, in_queue=444466, util=95.65%
  nvme0n2: ios=4411389/0, merge=3/0, ticks=442826/0, in_queue=442826, util=95.65%
  nvme3n2: ios=4411383/0, merge=5/0, ticks=445365/0, in_queue=445365, util=95.65%
  nvme2n2: ios=4411387/0, merge=5/0, ticks=443983/0, in_queue=443983, util=95.65%